// Задачник JavaScript по уровням

// Уровень 1
{
	// №1 Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.
	{
		// Вариант 1
		/*let num = prompt('Введите проверяемое число: ');
		if (Math.sign(num) >= 0) alert(`Число ${num} положительное`);
		else alert(`Число ${num} отрицательное`)*/

		// Вариант 2
		/*let num = -123;
		if (Math.sign(num) >= 0) console.log(`Число ${num} положительное`);
		else console.log(`Число ${num} отрицательно`);*/

		// Вариант 3 
		// let num = -123;
		// if (num >= 0) console.log(`Число ${num} положительное`);
		// else console.log(`Число ${num} отрицательное`);
	}

	// №2 Дана строка. Выведите в консоль длину этой строки
	{
		
	}
}